# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurveArray..::..ForwardIterator Method
SymbolicCurveArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual SymbolicCurveArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As SymbolicCurveArrayIterator
```

Visual C++
---
```text
public:
virtual SymbolicCurveArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
SymbolicCurveArray Class
Autodesk.Revit.DB Namespace